app/views/charities/_form.html.erb

SELECT "zip_codes".* FROM "zip_codes" ORDER BY zip DESC
---
     <%= f.label "Zipcode" %><br />
     <%= f.collection_select(:zip_code_id, ZipCode.order("zip ASC"), :id, :zip) %>