app/controllers/charities_controller.rb

SELECT "charities".* FROM "charities" ORDER BY ZipCode.zip LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "charities"
---
  def index
    @charities = Charity.page(params[:page]).per(2)

SELECT "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @charity = Charity.find(params[:id])

SELECT "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT 1  [["id", "8"]]
---
  def edit
    @charity = Charity.find(params[:id])

INSERT INTO "charities" ("created_at", "name", "updated_at", "url", "zip_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 01 Dec 2013 06:59:54 UTC +00:00], ["name", "t"], ["updated_at", Sun, 01 Dec 2013 06:59:54 UTC +00:00], ["url", "t"], ["zip_id", 1]]
---
  def create
    @charity = Charity.new(params[:charity])

    respond_to do |format|
      if @charity.save

SELECT "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "charities" SET "name" = 'Salvation Army', "url" = 'http://www.salvationarmy.org', "zip_code_id" = 12, "photo_file_name" = 'sa.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 7886, "photo_updated_at" = '2013-12-04 05:27:54.457283', "updated_at" = '2013-12-04 05:27:57.575461' WHERE "charities"."id" = 24
---
  def update
    @charity = Charity.find(params[:id])

    respond_to do |format|
      if @charity.update_attributes(params[:charity])

SELECT "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "charities" WHERE "charities"."id" = ?  [["id", 1]]
---
  def destroy
    @charity = Charity.find(params[:id])
    @charity.destroy