app/controllers/charities_controller.rb

  def index
    @charities = Charity.joins(:zip_code).order('zip_codes.zip').page(params[:page]).per(2)
---
SELECT "charities".* FROM "charities" INNER JOIN "zip_codes" ON "zip_codes"."id" = "charities"."zip_code_id" ORDER BY zip_codes.zip
SELECT COUNT(*) FROM "charities" INNER JOIN "zip_codes" ON "zip_codes"."id" = "charities"."zip_code_id"