app/controllers/zip_codes_controller.rb

SELECT "zip_codes".* FROM "zip_codes" ORDER BY zip
---
  def index
    @zip_codes = ZipCode.order(:zip)

SELECT "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @zip_code = ZipCode.find(params[:id])

SELECT "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    @zip_code = ZipCode.find(params[:id])

INSERT INTO "zip_codes" ("created_at", "updated_at", "zip") VALUES (?, ?, ?)  [["created_at", Mon, 02 Dec 2013 18:47:08 UTC +00:00], ["updated_at", Mon, 02 Dec 2013 18:47:08 UTC +00:00], ["zip", "33543"]]
---
  def create

    @zip_code = ZipCode.new(params[:zip_code])

    respond_to do |format|

      if @zip_code.save

SELECT "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."id" = ? LIMIT 1  [["id", "6"]]
---
  def update
    @zip_code = ZipCode.find(params[:id])

SELECT "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "zip_codes" WHERE "zip_codes"."id" = ?  [["id", 8]]
---
  def destroy
    @zip_code = ZipCode.find(params[:id])
    @zip_code.destroy